In [1]:
import pandas as pd
import numpy as np

In [2]:
forum_users = {
    'User_ID': np.array([1, 2, 3, 4, 5]),
    'Username': ['Bogdan_s', 'Jane_Smith', 'Alex123', 'Bob56', 'Mark_Wilson'],
    'Age': [18, 35, 25, 38, 33],
    'Joined date': pd.to_datetime(['2032-01-01', '2032-02-10', '2032-01-19', '2032-01-25', '2032-03-15']),
    'Total Posts': [150, 230, 80, 420, 310],
    'Reputation': [500, 720, 200, 940, 500]
} 

df = pd.DataFrame(forum_users)    
df

   User_ID     Username  Age Joined date  Total Posts  Reputation
0        1     Bogdan_s   18  2032-01-01          150         500
1        2   Jane_Smith   35  2032-02-10          230         720
2        3      Alex123   25  2032-01-19           80         200
3        4        Bob56   38  2032-01-25          420         940
4        5  Mark_Wilson   33  2032-03-15          310         500

In [ ]:
df['Language'] = 'English' # Добавление столбца с одинаковыми значениями
df

   User_ID     Username  Age Joined date  Total Posts  Reputation Language
0        1     Bogdan_s   18  2032-01-01          150         500  English
1        2   Jane_Smith   35  2032-02-10          230         720  English
2        3      Alex123   25  2032-01-19           80         200  English
3        4        Bob56   38  2032-01-25          420         940  English
4        5  Mark_Wilson   33  2032-03-15          310         500  English

In [ ]:
df['Active'] = [True, True, False, True, False] 
df # Добавление столбца с разными значениями

,User_ID,Username,Age,Joined date,Total Posts,Reputation,Language,Active
0,1,Bogdan_s,18,2032-01-01,150,500,English,True
1,2,Jane_Smith,35,2032-02-10,230,720,English,True
2,3,Alex123,25,2032-01-19,80,200,English,False
3,4,Bob56,38,2032-01-25,420,940,English,True
4,5,Mark_Wilson,33,2032-03-15,310,500,English,False